insert into recipe_detail (id, recipe_id, product_type_id, amount, unit_id) values
(1, 1, 1, 500, 'g'), -- 豚の角煮: 豚バラ
(2, 1, 2, 50, 'g'),  -- 豚の角煮: 生姜
(3, 1, 3, 1, 'g'),   -- 豚の角煮: 辛子
(4, 2, 5, 1, '個'),  -- 豚の生姜焼き梨ソース: 梨
(5, 2, 1, 200, 'g'), -- 豚の生姜焼き梨ソース: 豚バラ
(6, 2, 4, 1, '個'),  -- 豚の生姜焼き梨ソース: 玉ねぎ
(7, 2, 2, 10, 'g'),  -- 豚の生姜焼き梨ソース: 生姜
(8, 3, 1, 100, 'g'), -- 豚しゃぶとゴーヤのサラダ: 豚バラ
(9, 3, 6, 1, '本'),  -- 豚しゃぶとゴーヤのサラダ: ゴーヤ
(10, 3, 4, 1, '個'), -- 豚しゃぶとゴーヤのサラダ: 玉ねぎ
(11, 3, 7, 2, '個'), -- 豚しゃぶとゴーヤのサラダ: ミニトマト
(12, 3, 8, 1, '袋'), -- 豚しゃぶとゴーヤのサラダ: もやし
(13, 4, 9, 400, 'g'),-- 味噌バターコーン豚丼: ごはん
(14, 4, 1, 150, 'g'),-- 味噌バターコーン豚丼: 豚バラ
(15, 4, 10, 1, '個'),-- 味噌バターコーン豚丼: コーン缶
(16, 4, 11, 20, 'g');-- 味噌バターコーン豚丼: みそ
