insert into recipe (id, name, instruction, url) values
(1, '豚の角煮', 
'フライパンに火をかけ、豚肉の表面に焼き色をつける。,全体的に焼き目がついたら、熱湯にくぐらせ、油を落とします。,鍋に①とおからを入れ、かぶる位の水を注ぎ（分量外）火にかけます。,肉が柔らかくなり、箸がすっと通るまでコトコトと煮ます。（約1時間程度）。※途中、脂が浮いてきたら、すくい取って下さい。, ② を水にさらして、おからを洗い流し、水気をふき取ります。, お肉を鍋に入れ、水（分量外）を加え、火にかけ、ひと煮立ちさせ、バットに上げて、冷まし、食べやすい大きさに切ります。, 鍋に<A>を入れ、①の豚肉、生姜を入れ火にかけ、沸騰したら弱火にし、15～20分煮ます。, 器に盛り付け、煮汁を注ぎ、茹でた絹さや、お好みで和辛子を添えたら出来上がりです。',
'https://yorkbenimaru.com/osusume_menu/recipe/'),
(2, '豚の生姜焼き梨ソース', 
'梨の半量はすりおろしてボウルに入れ、調味料Aを加えて混ぜておきます。,残りの梨はひと口大の2～3㎜の厚さに切り、玉ねぎは薄切りにします。, フライパンにサラダ油を熱し、玉ねぎを入れて軽く火を通します。,豚肉を加え、ある程度火が通ったら、合わせておいた①の調味料を加え全体を混ぜながら炒めます。,豚肉に火が通ったら汁は残してお皿に入れます。, 汁が残ったフライパンを強火で熱し、少し煮詰めたら② の梨を加えてさっとからめ、肉の上にかけます。',
'https://yorkbenimaru.com/osusume_menu/recipe/'),
(3, '豚しゃぶとゴーヤのサラダ', 
'豚肉は茹でてざるに上げ、自然に冷まします。ゴーヤは薄切りにし、玉ねぎは薄切りにして水にさらします。,ミニトマトは半分に切ります。, ゴーヤ、もやしは食感が残るようにさっと茹でます。, 皿に①、②を盛り付け、ドレッシングをかけていただきます。',
'https://yorkbenimaru.com/osusume_menu/recipe/'),
(4, '味噌バターコーン豚丼', 
'ボウルに☆を入れて混ぜ、みそを溶かす。, フライパンにサラダ油を入れて熱し、豚肉を入れて肉の色が変わるまで中火で2分程炒める。, コーン缶を加えて1分程炒める。☆を加えて水分がなくなるまで煮からめる。, 器にごはんを盛り、3、バターを等分ずつのせる。同様に計2杯作る。',
'https://yorkbenimaru.com/osusume_menu/recipe/');
